tutorial/Turning35-2/background/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(hull*.*|rudder)"
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        value           uniform (0 0 0); // just meet the definition, has no sense
        inletValue      uniform (0 0 0 );
    }

    //outlet
    //{
    //    type            outletPhaseMeanVelocity;
    //    alpha           alpha.water;
    //    Umean           -2.196;
    //    value           $internalField;
    //}
    
    "(atmosphere)"
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    "(overset-1|overset-2)"
    {
        type           overset;
    }
}


// ************************************************************************* //
